sdaiUnsetArrayByIndex(Sdai_Id_aggr*,System.UInt32)
\details
Unsets a specified element of the application instances array.
\param array [in] An array of application instances.
\param index [in] An index value that determines the element position in the array.